import React from "react";
import "styles/footer.css";

export default function Footer() {
  return (
    <div className="main-footer">
      <div className="social">
        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="42"
          height="42"
          viewBox="0 0 42 42"
        >
          <g
            id="Groupe_27"
            data-name="Groupe 27"
            transform="translate(0 -0.485)"
          >
            <rect
              id="Rectangle_20"
              data-name="Rectangle 20"
              width="42"
              height="42"
              transform="translate(0 0.485)"
              opacity="0"
            />
            <g
              id="Groupe_26"
              data-name="Groupe 26"
              transform="translate(3.54 3.629)"
            >
              <path
                id="Tracé_15"
                data-name="Tracé 15"
                d="M19.7,2a17.691,17.691,0,0,0-2.646,35.185V24.393H12.676V19.739h4.379v-3.1c0-5.127,2.5-7.376,6.759-7.376a24.7,24.7,0,0,1,3.631.22v4.061H24.538c-1.809,0-2.441,1.715-2.441,3.648v2.544h5.3l-.719,4.654H22.1V37.222A17.692,17.692,0,0,0,19.7,2Z"
                transform="translate(-2 -2)"
              />
            </g>
          </g>
        </svg>

        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="46"
          height="46"
          viewBox="0 0 46 46"
        >
          <g
            id="Groupe_29"
            data-name="Groupe 29"
            transform="translate(0 -0.023)"
          >
            <rect
              id="Rectangle_21"
              data-name="Rectangle 21"
              width="46"
              height="46"
              transform="translate(0 0.023)"
              fill="#232323"
              opacity="0"
            />
            <g
              id="Groupe_28"
              data-name="Groupe 28"
              transform="translate(4.046 8.732)"
            >
              <path
                id="Tracé_16"
                data-name="Tracé 16"
                d="M9.106,16.393V5.662l-.1-.073H9L6.747,3.923a3.532,3.532,0,0,0-4.56.231A4.453,4.453,0,0,0,.86,7.328V10.3Zm21.438-.011v.011L38.789,10.3V7.328a4.456,4.456,0,0,0-1.3-3.158,3.439,3.439,0,0,0-4.472-.332L30.643,5.588l-.1.073ZM10.755,17.6l8.58,6.342a.825.825,0,0,0,.98,0L28.895,17.6V6.881l-9.07,6.706-9.07-6.706Zm19.789.842V30.9a.825.825,0,0,0,.825.825h5.36a2.061,2.061,0,0,0,2.061-2.061V12.347Zm-21.438,0L.86,12.347V29.665a2.061,2.061,0,0,0,2.061,2.061h5.36a.825.825,0,0,0,.825-.825Z"
                transform="translate(-0.86 -3.165)"
              />
            </g>
          </g>
        </svg>

        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="46"
          height="46"
          viewBox="0 0 46 46"
        >
          <g id="Groupe_31" data-name="Groupe 31" transform="translate(0 0.13)">
            <rect
              id="Rectangle_22"
              data-name="Rectangle 22"
              width="46"
              height="46"
              transform="translate(0 -0.131)"
              fill="#232323"
              opacity="0"
            />
            <g
              id="Groupe_30"
              data-name="Groupe 30"
              transform="translate(3.897 7.488)"
            >
              <path
                id="Tracé_17"
                data-name="Tracé 17"
                d="M38.052,5.308a14.4,14.4,0,0,1-4.441,1.27A8.437,8.437,0,0,0,37.1,2.292,14.467,14.467,0,0,1,32.187,4.2,8.3,8.3,0,0,0,26.322,1.66a7.78,7.78,0,0,0-7.773,7.767,5.864,5.864,0,0,0,.161,1.747A21.689,21.689,0,0,1,2.694,3.084,6.825,6.825,0,0,0,1.586,7.048a7.951,7.951,0,0,0,3.487,6.5A11.276,11.276,0,0,1,1.586,12.6v.161A7.7,7.7,0,0,0,7.767,20.37a8.146,8.146,0,0,1-2.056.316,4.346,4.346,0,0,1-1.431-.161,7.526,7.526,0,0,0,7.3,5.395A15.851,15.851,0,0,1,1.9,29.245,7.894,7.894,0,0,1,0,29.091a22.215,22.215,0,0,0,11.891,3.487c14.431,0,22.2-11.891,22.2-22.2V9.427a16.278,16.278,0,0,0,3.964-4.119"
                transform="translate(0 -1.66)"
              />
            </g>
          </g>
        </svg>

        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="40"
          height="40"
          viewBox="0 0 40 40"
        >
          <g
            id="Groupe_33"
            data-name="Groupe 33"
            transform="translate(0 -0.372)"
          >
            <rect
              id="Rectangle_23"
              data-name="Rectangle 23"
              width="40"
              height="40"
              transform="translate(0 0.372)"
              fill="#232323"
              opacity="0"
            />
            <g
              id="Groupe_32"
              data-name="Groupe 32"
              transform="translate(3.549 3.549)"
            >
              <path
                id="Tracé_18"
                data-name="Tracé 18"
                d="M17.5.86A16.635,16.635,0,0,0,3,25.663L.887,33.215a.723.723,0,0,0,.7.919.745.745,0,0,0,.174-.021L9.638,32.16A16.636,16.636,0,1,0,17.5.86Zm8.369,22.507a4.4,4.4,0,0,1-2.883,2.005,5.937,5.937,0,0,1-2.691-.167,25.032,25.032,0,0,1-2.435-.889c-4.284-1.827-7.082-6.087-7.3-6.368a8.149,8.149,0,0,1-1.744-4.362,4.7,4.7,0,0,1,1.5-3.518,1.579,1.579,0,0,1,1.139-.528c.285,0,.569,0,.819.015s.615-.1.961.724c.356.845,1.21,2.92,1.316,3.132a.77.77,0,0,1,.036.739,2.843,2.843,0,0,1-.427.7c-.214.247-.448.55-.641.739-.214.21-.436.438-.187.861A12.71,12.71,0,0,0,15.7,19.376a11.71,11.71,0,0,0,3.434,2.093c.427.211.676.176.925-.106s1.068-1.232,1.352-1.654.569-.352.961-.211,2.492,1.16,2.919,1.371.712.317.819.493A3.477,3.477,0,0,1,25.866,23.367Z"
                transform="translate(-0.86 -0.86)"
              />
            </g>
          </g>
        </svg>
      </div>
      <div className="link">
        <h3>VINS</h3>
        <h4>|</h4>
        <h3>PLATS</h3>
        <h4>|</h4>
        <h3>CONTACT</h3>
      </div>
      <div className="contact">
        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="32"
          height="32"
          viewBox="0 0 32 32"
        >
          <g
            id="Groupe_36"
            data-name="Groupe 36"
            transform="translate(0 -0.04)"
          >
            <rect
              id="Rectangle_24"
              data-name="Rectangle 24"
              width="32"
              height="32"
              transform="translate(0 0.039)"
              fill="#232323"
              opacity="0"
            />
            <g
              id="Groupe_35"
              data-name="Groupe 35"
              transform="translate(2.657 4.729)"
            >
              <path
                id="Tracé_19"
                data-name="Tracé 19"
                d="M14.887,2.3a1.028,1.028,0,0,0-1.012,1.042V7.453a1.028,1.028,0,1,0,2.056,0V3.341A1.028,1.028,0,0,0,14.887,2.3ZM5.443,6.219a1.028,1.028,0,0,0-.715,1.765L7.635,10.89A1.028,1.028,0,1,0,9.089,9.437L6.182,6.53A1.028,1.028,0,0,0,5.443,6.219Zm18.888,0a1.028,1.028,0,0,0-.707.311L20.717,9.437a1.028,1.028,0,1,0,1.453,1.454l2.907-2.907a1.028,1.028,0,0,0-.747-1.765Zm-9.426,9.458c-11.583,0-13.365,3.415-13.365,6.495a4.017,4.017,0,0,0,.53,2.122,1.21,1.21,0,0,0,1.345.546l5.423-1.417a1.207,1.207,0,0,0,.865-.875l.55-2.174a1.205,1.205,0,0,1,1.024-.906,31.328,31.328,0,0,1,3.628-.249,31.306,31.306,0,0,1,3.626.249,1.207,1.207,0,0,1,1.024.906l.55,2.174a1.209,1.209,0,0,0,.869.875l5.413,1.415a1.217,1.217,0,0,0,1.351-.548,4.015,4.015,0,0,0,.528-2.118C28.266,19.092,26.488,15.677,14.905,15.677Z"
                transform="translate(-1.54 -2.299)"
                fill="#232323"
              />
            </g>
          </g>
        </svg>
        <h3>+33 6 59 92 02 02</h3>
      </div>
      <div className="copyright">
        <p>Winepal | copyright 2023 - Tous droits réservés</p>
      </div>
    </div>
  );
}
